<?switch ($_GET['sub']) {
    case "template":
?>
<p align="left"><font size="3" face="Verdana">Справка<br></font></p>
<form name="form1" method="post">
    <div align="left">
        <p>[<b>Общие сведения</b>]<br>
Скрипт использует шаблонизатор Smarty. Help по шаблонизатору можно скачать <a href="http://www.smarty.net/distributions/manual/ru/Smarty-2.6.7-docs.chm">здесь</a>.</p>
        <p>[<b>Основные включения</b>]<br>
Вы можите как самостоятельно писать блоки, так и использовать готовые. Вот уже сформированные блоки:<br>
{include file=&quot;header.html&quot;} - включает заголовок страницы. Используются переменные {$name}, {$title}, {$keywords}, {$description} и подключается стиль default.css подгружается конфигурация index.conf<br>
{include file=&quot;logo.html&quot;} - выводит логотип (название сайта плюс слоган). Используются переменные {$name} {$slogan} так же указывается id лого (#logo#) используемое в стиле. Указать id лого можно в файле index.conf переменная logo.<br>
{include file=&quot;news.html&quot;} - блок новостей. Можно выбрать тип блока новостей #newstype# (указывается в index.conf). Так же в файле конфигурации можно указать {#newsid#} - id основного div. {#newsclass#} - класс основного div. Так же используется массив новостей {$news}<br>
{include file=&quot;menu.html&quot;} - блок меню. Если в файле указать #menu# то будет использовано меню из 4-х элементов, если вообще не указать #menu# то будет использовано меню из пяти элементов. Элементы расположены в виде массива {$m}<br>
{include file=&quot;sidebar.html&quot;} - блок перелинковки. Можно указать id слоя div #sidebar# в файле index.conf. В сайд баре показывается меню {$m}&nbsp;и блок перелинковки {$blockul.7}.<br>
{include file=&quot;footer.html&quot;} - низ страницы, копирайты. Используется переменная {$year}.</p>
        <p>[<b>Описание переменных</b>]<br>
{$blockol.visable} - показывать ли блок перелинковки<br>
{$blockul.title} - название блока перелинковки<br>
{$blockul.1} - блок перелинковки 1&nbsp;ссылка<br>
{$blockul.2} - блок перелинковки 2&nbsp;ссылки<br>
{$blockul.3} - блок перелинковки 3&nbsp;ссылки<br>
{$blockul.4} - блок перелинковки 4&nbsp;ссылки<br>
{$blockul.5} - блок перелинковки 5&nbsp;ссылок<br>
{$blockul.6} - блок перелинковки 6&nbsp;ссылок<br>
{$blockul.7} - блок перелинковки 7 ссылок<br>
{$blockol.visable} - показывать ли блок перелинковки<br>
{$blockol.title} - название блока перелинковки<br>
{$blockol.1} - блок перелинковки 1&nbsp;ссылка<br>
{$blockol.2} - блок перелинковки 2&nbsp;ссылки<br>
{$blockol.3} - блок перелинковки 3&nbsp;ссылки<br>
{$blockol.4} - блок перелинковки 4&nbsp;ссылки<br>
{$blockol.5} - блок перелинковки 5&nbsp;ссылок<br>
{$blockol.6} - блок перелинковки 6&nbsp;ссылок<br>
{$blockol.7} - блок перелинковки 7 ссылок<br>
{$year} - год<br>
{$name} - название блога (одно слово)<br>
{$title} - заголовок страницы<br>
{$content} - содержимое статьи<br>
{$keywords} - ключевые слова<br>
{$description} - описание страницы<br>
{$slogan} - основной кей (по которому найден контент)<br>
{$m} - массив меню (максимум 5)<br>
{$m.0.activ} - если это текущая страница то вставляется код если нет то пусто<br>
{$m.0.url} - ссылка на страницу из&nbsp;пункта меню<br>
{$m.0.str} - заголовок пункта меню<br>
{$news.title} - название раздела новостей<br>
{$news} - массив новостей (не ограничено по количеству)<br>
{$news.0.title} - заголовок новости<br>
{$news.0.content} - содержимое новости<br>
{$news.0.url} - ссылка на новость<br>
{$news.0.date} - время публикации новости, например {$news.0.date|date_format:&quot;%e %B %Y&quot;}<br>
&nbsp;</p>
    </div>
</form>
<?
      break;
    case "video":
?>
<p align="left"><font size="3" face="Verdana">Видео<br></font></p>
<form name="form1" method="post">
    <div align="left">
        <p>[<b>Ссылки на видео</b>]<br>
           <a href="http://vipbablo.ru/download/video.exe">Видео 1</a><br>
           <a href="http://vipbablo.ru/download/video1.exe">Видео 2</a><br>
           <a href="http://vipbablo.ru/download/video2.exe">Видео 3</a><br>
           <a href="http://vipbablo.ru/download/video3.exe">Видео 4</a><br>
        </p>
    </div>
</form>
<?
      break;
    default:
?>
<p align="left"><font size="3" face="Verdana">Справка<br></font></p>
<form name="form1" method="post">
    <div align="left">

        <p>[<b>Общие сведения</b>]<br>
Скрипт предназначен для генерации небольших сайтов - сателлитов. Скрипт полностью автоматизирован: он сам находит контент используя поисковик, сам находит изображения, сам формирует меню, формирует ключевые слова, описание, рецензию к каждой странице,&nbsp;сам перелинковывает страницы. Скрипт имеет много втроенных шаблонов и ежедневно пользователи могут получать новые шаблоны. Шаблоны написаны на популярном и очень гибком шаблонизаторе Smarty, который используется в большинстве CMS в том числе в WordPress. Скрипт умеет сохранять страници как в HTML так и в PHP движке.</p>
        <p>[<b>Алгоритм работы</b>]<br>
<font size="2"><b>Шаг 1</b></font> Вебмастервводит данные для проекта.&nbsp;вводит ключевую фразу, ключевое слово, количество желаемых
страниц, выбирает шаблон, указывает требуется ли уникальный контент<br>
<font size="2"><b>Шаг 2</b></font>&nbsp;скрипт идет в поисковик и дергает выдачу по фразе<br>
<font size="2"><b>Шаг 3</b></font>&nbsp;скрипт идет на каждый сайт из выдачи и берет оттуда только статью (отбрасывая мусор, оставляет только текст)<br>
<b><font size="2">Шаг 4</font></b>&nbsp;если требовался уникальный контент скрипт переводит статью на
английский а затем снова на русский в итоге получается контент со
схожестью в 30-40%<br>
<font size="2"><b>Шаг 5</b></font> Если пользователь указал, скрипт может синонимизировать статью.<br>
<b><font size="2">Шаг 6</font></b>&nbsp;скрипт идет в поиск по картинкам и по слову ищет картинки<br>
<font size="2"><b>Шаг 7</b></font>&nbsp;скрипт анализирует полученные тексты используя русскоязычную
морфологию, формирует ключевые слова, слова для меню, новостные
реценззи (если требуются в шаблоне)<br>
<font size="2"><b>Шаг 8</b></font>&nbsp;скрипт вставляет картинки в полученные тексты.<br>
<font size="2"><b>Шаг 9</b></font>&nbsp;на основе выбранного шаблона скрипт формирует html страницы либо данные для php движка<br>
<font size="2"><b>Шаг 10</b></font>&nbsp;скрипт архивирует часть шаблона (картинки и стили) и добавляет в архив сгенерированные страницы<br>
<font size="2"><b>Шаг 11</b></font>&nbsp;архив записывается в отдельную папку и ссылка на архив передается пользователю<br>
<font size="2"><b>Шаг 12</b></font> Если пользователь указал скрипт может залить результат&nbsp;на ФТП.</p>
        <p>[<b>Возможности</b>]<br>
<u>- премодерация</u> - вы можете самостоятельно выбрать какие статьи использовать в сателлите, можете отредактировать статьи<br>
<u>- инклюд SAPE</u> - автоматически вставится код SAPE, вы можете выбрать в какое место вставлять ссылки<br>
<u>- генерируется карта сайта</u> - скрипт автоматически генерирует карту сайта (map.html)<br>
<u>- многопоточная загрузка</u> - скрипт может загружать страницы одновременно с нескольких сайтов, это ускоряет работу в разы.<br>
<u>- визуальное оформление действий скрипта</u> - вы всегда знаете чем скрипт сейчас занимается<br>
<u>- </u><u>архивирование готового сателлита</u> - вы получаете полноценный сателлит в архиве.<br>
<u>- синонимайзер</u> - выможите синонимизировать полученные статьи чтобы получить уникальный контент<br>
<u>- уникализатор</u> - вы можите перевести статью на английский а потом снова на русский чтобы получить уникальную статью<br>
<u>- установка картинок настраиваемая </u>- вы можите указать сколько картинок устанавливать на странице<br>
<u>- имена файлов</u> - вы можите указать как называть файл, цирами, словом и т.д.<br>
<u>- тип сохранения</u> - скрипт может сохранять страницы как в html, так и в php движке<br>
<u>- превью шаблонов</u> - перед генерацией вы сможите видеть выбранный шаблон<br>
<u>- укзание количества страниц</u> - вы можите произвольно указать количество страниц неважно будет их 15 или 150...<br>
<u>- указание минимальной&nbsp;длины текста </u>- если текст меньше указанной длинны то он использоватся не будет<br>
<u>- указание максимальной длины</u> - если текст больше, он будет обрезан<br>
<u>- указание меню вручную</u> - вы можете самостоятельно ввести необходимые пункты меню<br>
<u>- архиватор zip</u> - вы можите получить сгенерированный сателлит в виде zip архива.<br>
<u>- заливка на ФТП </u>- вы можите автоматически закачать сгенерированный сателлит на указанный вами&nbsp;фтп сервер.<br>
<u>- встроенный help</u> - вы можите получить справку прямо в програме</p>
        <p>[<b>Установка на локальный компьютер</b>]<br>
<font size="2"><b>шаг 1</b></font> скачайте и установите Denwer, с сайта denwer.ru<br>
<font size="2"><b>шаг 2</b></font> скопируйте &nbsp;содержимое архива в папку /home/<br>
<font size="2"><b>шаг 3</b></font> перезапустите Denwer<br>
<font size="2"><b>шаг 4</b></font> запустите браузер FireFox<br>
<font size="2"><b>шаг 5</b></font> в адрессной строке введите <a href="http://vipbablo">http://vipbablo</a></p>
        <p>[<b>Установка на хостинг</b>]<br>
<font size="2"><i>Внимание! Мы не даем гарантии что скрипт будет работать на любом хостинге. Сами понимаете это не какая-то CMS это сложный инструмент. Обратитесь в саппорт и вам посоветуют хостинг провайдера у которого скрипт будет работать нормально.</i></font><br>
<font size="2"><b>шаг 1</b></font>&nbsp;скопируйте &nbsp;содержимое архива в подпапку вашего домена<br>
<b><font size="2">шаг 2</font></b>&nbsp;Установите права на запись для файла config.php и папок compile, zip, pages, googleim, google, out<br>
<b><font size="2">шаг 3</font></b>&nbsp;запустите браузер FireFox<br>
<font size="2"><b>шаг 4</b></font>&nbsp;в адрессной строке введите ваш домен с учетом подпапки</p>
        <p>[<b>Требования</b>]<br>
1. Наличие интернета<br>
2. Apache<br>
3. PHP 4 и выше<br>
4. Разрешен произвольный TimeOut<br>
5. Firefox - хороший браузер<br>
&nbsp;</p>
    </div>
</form>
<?
      break;
  }

?>